{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_1_output",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "initial_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input1",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 1,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "activation_1_output",
      "pad_l" : 0,
      "name" : "max_pooling2d_1",
      "top" : "max_pooling2d_1_output"
    },
    {
      "name" : "dense_0_0_bn",
      "bottom" : "max_pooling2d_1_output",
      "weights" : {

      },
      "top" : "dense_0_0_bn_output",
      "C" : 64,
      "blob_batchnorm_params" : 5,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_2_output",
      "type" : "activation",
      "name" : "activation_2",
      "bottom" : "dense_0_0_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_3_output",
      "blob_weights" : 9,
      "K" : 64,
      "blob_biases" : 7,
      "name" : "dense_0_0_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_2_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_0_0_conv2D_output",
      "blob_weights" : 11,
      "K" : 128,
      "name" : "dense_0_0_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_3_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_1_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_1",
      "bottom" : "max_pooling2d_1_output,dense_0_0_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_1_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_1_output",
      "type" : "activation",
      "name" : "concatenate_1__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_0_1_bn",
      "bottom" : "concatenate_1_output",
      "weights" : {

      },
      "top" : "dense_0_1_bn_output",
      "C" : 96,
      "blob_batchnorm_params" : 13,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_4_output",
      "type" : "activation",
      "name" : "activation_4",
      "bottom" : "dense_0_1_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_5_output",
      "blob_weights" : 17,
      "K" : 96,
      "blob_biases" : 15,
      "name" : "dense_0_1_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_4_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_0_1_conv2D_output",
      "blob_weights" : 19,
      "K" : 128,
      "name" : "dense_0_1_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_5_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_2_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_2",
      "bottom" : "concatenate_1_output,dense_0_1_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_2_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_2_output",
      "type" : "activation",
      "name" : "concatenate_2__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_0_2_bn",
      "bottom" : "concatenate_2_output",
      "weights" : {

      },
      "top" : "dense_0_2_bn_output",
      "C" : 128,
      "blob_batchnorm_params" : 21,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_6_output",
      "type" : "activation",
      "name" : "activation_6",
      "bottom" : "dense_0_2_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_7_output",
      "blob_weights" : 25,
      "K" : 128,
      "blob_biases" : 23,
      "name" : "dense_0_2_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_6_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_0_2_conv2D_output",
      "blob_weights" : 27,
      "K" : 128,
      "name" : "dense_0_2_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_7_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_3_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_3",
      "bottom" : "concatenate_2_output,dense_0_2_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_3_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_3_output",
      "type" : "activation",
      "name" : "concatenate_3__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_0_3_bn",
      "bottom" : "concatenate_3_output",
      "weights" : {

      },
      "top" : "dense_0_3_bn_output",
      "C" : 160,
      "blob_batchnorm_params" : 29,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_8_output",
      "type" : "activation",
      "name" : "activation_8",
      "bottom" : "dense_0_3_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_9_output",
      "blob_weights" : 33,
      "K" : 160,
      "blob_biases" : 31,
      "name" : "dense_0_3_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_8_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_0_3_conv2D_output",
      "blob_weights" : 35,
      "K" : 128,
      "name" : "dense_0_3_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_9_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_4_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_4",
      "bottom" : "concatenate_3_output,dense_0_3_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_4_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_4_output",
      "type" : "activation",
      "name" : "concatenate_4__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_0_4_bn",
      "bottom" : "concatenate_4_output",
      "weights" : {

      },
      "top" : "dense_0_4_bn_output",
      "C" : 192,
      "blob_batchnorm_params" : 37,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_10_output",
      "type" : "activation",
      "name" : "activation_10",
      "bottom" : "dense_0_4_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_11_output",
      "blob_weights" : 41,
      "K" : 192,
      "blob_biases" : 39,
      "name" : "dense_0_4_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_10_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_0_4_conv2D_output",
      "blob_weights" : 43,
      "K" : 128,
      "name" : "dense_0_4_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_11_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_5_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_5",
      "bottom" : "concatenate_4_output,dense_0_4_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_5_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_5_output",
      "type" : "activation",
      "name" : "concatenate_5__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_0_5_bn",
      "bottom" : "concatenate_5_output",
      "weights" : {

      },
      "top" : "dense_0_5_bn_output",
      "C" : 224,
      "blob_batchnorm_params" : 45,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_12_output",
      "type" : "activation",
      "name" : "activation_12",
      "bottom" : "dense_0_5_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_13_output",
      "blob_weights" : 49,
      "K" : 224,
      "blob_biases" : 47,
      "name" : "dense_0_5_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_12_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_0_5_conv2D_output",
      "blob_weights" : 51,
      "K" : 128,
      "name" : "dense_0_5_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_13_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_6_output",
      "type" : "concat",
      "name" : "concatenate_6",
      "bottom" : "concatenate_5_output,dense_0_5_conv2D_output"
    },
    {
      "name" : "tr_0_bn",
      "bottom" : "concatenate_6_output",
      "weights" : {

      },
      "top" : "tr_0_bn_output",
      "C" : 256,
      "blob_batchnorm_params" : 53,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_14_output",
      "type" : "activation",
      "name" : "activation_14",
      "bottom" : "tr_0_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "tr_0_conv2D_output",
      "blob_weights" : 55,
      "K" : 256,
      "name" : "tr_0_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "activation_14_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 0,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "tr_0_conv2D_output",
      "pad_l" : 0,
      "name" : "average_pooling2d_1",
      "top" : "average_pooling2d_1_output"
    },
    {
      "name" : "dense_1_0_bn",
      "bottom" : "average_pooling2d_1_output",
      "weights" : {

      },
      "top" : "dense_1_0_bn_output",
      "C" : 128,
      "blob_batchnorm_params" : 57,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_15_output",
      "type" : "activation",
      "name" : "activation_15",
      "bottom" : "dense_1_0_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_16_output",
      "blob_weights" : 61,
      "K" : 128,
      "blob_biases" : 59,
      "name" : "dense_1_0_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_15_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_1_0_conv2D_output",
      "blob_weights" : 63,
      "K" : 128,
      "name" : "dense_1_0_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_16_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_7_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_7",
      "bottom" : "average_pooling2d_1_output,dense_1_0_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_7_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_7_output",
      "type" : "activation",
      "name" : "concatenate_7__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_1_1_bn",
      "bottom" : "concatenate_7_output",
      "weights" : {

      },
      "top" : "dense_1_1_bn_output",
      "C" : 160,
      "blob_batchnorm_params" : 65,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_17_output",
      "type" : "activation",
      "name" : "activation_17",
      "bottom" : "dense_1_1_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_18_output",
      "blob_weights" : 69,
      "K" : 160,
      "blob_biases" : 67,
      "name" : "dense_1_1_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_17_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_1_1_conv2D_output",
      "blob_weights" : 71,
      "K" : 128,
      "name" : "dense_1_1_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_18_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_8_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_8",
      "bottom" : "concatenate_7_output,dense_1_1_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_8_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_8_output",
      "type" : "activation",
      "name" : "concatenate_8__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_1_2_bn",
      "bottom" : "concatenate_8_output",
      "weights" : {

      },
      "top" : "dense_1_2_bn_output",
      "C" : 192,
      "blob_batchnorm_params" : 73,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_19_output",
      "type" : "activation",
      "name" : "activation_19",
      "bottom" : "dense_1_2_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_20_output",
      "blob_weights" : 77,
      "K" : 192,
      "blob_biases" : 75,
      "name" : "dense_1_2_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_19_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_1_2_conv2D_output",
      "blob_weights" : 79,
      "K" : 128,
      "name" : "dense_1_2_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_20_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_9_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_9",
      "bottom" : "concatenate_8_output,dense_1_2_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_9_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_9_output",
      "type" : "activation",
      "name" : "concatenate_9__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_1_3_bn",
      "bottom" : "concatenate_9_output",
      "weights" : {

      },
      "top" : "dense_1_3_bn_output",
      "C" : 224,
      "blob_batchnorm_params" : 81,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_21_output",
      "type" : "activation",
      "name" : "activation_21",
      "bottom" : "dense_1_3_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_22_output",
      "blob_weights" : 85,
      "K" : 224,
      "blob_biases" : 83,
      "name" : "dense_1_3_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_21_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_1_3_conv2D_output",
      "blob_weights" : 87,
      "K" : 128,
      "name" : "dense_1_3_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_22_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_10_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_10",
      "bottom" : "concatenate_9_output,dense_1_3_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_10_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_10_output",
      "type" : "activation",
      "name" : "concatenate_10__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_1_4_bn",
      "bottom" : "concatenate_10_output",
      "weights" : {

      },
      "top" : "dense_1_4_bn_output",
      "C" : 256,
      "blob_batchnorm_params" : 89,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_23_output",
      "type" : "activation",
      "name" : "activation_23",
      "bottom" : "dense_1_4_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_24_output",
      "blob_weights" : 93,
      "K" : 256,
      "blob_biases" : 91,
      "name" : "dense_1_4_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_23_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_1_4_conv2D_output",
      "blob_weights" : 95,
      "K" : 128,
      "name" : "dense_1_4_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_24_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_11_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_11",
      "bottom" : "concatenate_10_output,dense_1_4_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_11_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_11_output",
      "type" : "activation",
      "name" : "concatenate_11__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_1_5_bn",
      "bottom" : "concatenate_11_output",
      "weights" : {

      },
      "top" : "dense_1_5_bn_output",
      "C" : 288,
      "blob_batchnorm_params" : 97,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_25_output",
      "type" : "activation",
      "name" : "activation_25",
      "bottom" : "dense_1_5_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_26_output",
      "blob_weights" : 101,
      "K" : 288,
      "blob_biases" : 99,
      "name" : "dense_1_5_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_25_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_1_5_conv2D_output",
      "blob_weights" : 103,
      "K" : 128,
      "name" : "dense_1_5_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_26_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_12_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_12",
      "bottom" : "concatenate_11_output,dense_1_5_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_12_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_12_output",
      "type" : "activation",
      "name" : "concatenate_12__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_1_6_bn",
      "bottom" : "concatenate_12_output",
      "weights" : {

      },
      "top" : "dense_1_6_bn_output",
      "C" : 320,
      "blob_batchnorm_params" : 105,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_27_output",
      "type" : "activation",
      "name" : "activation_27",
      "bottom" : "dense_1_6_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_28_output",
      "blob_weights" : 109,
      "K" : 320,
      "blob_biases" : 107,
      "name" : "dense_1_6_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_27_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_1_6_conv2D_output",
      "blob_weights" : 111,
      "K" : 128,
      "name" : "dense_1_6_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_28_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_13_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_13",
      "bottom" : "concatenate_12_output,dense_1_6_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_13_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_13_output",
      "type" : "activation",
      "name" : "concatenate_13__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_1_7_bn",
      "bottom" : "concatenate_13_output",
      "weights" : {

      },
      "top" : "dense_1_7_bn_output",
      "C" : 352,
      "blob_batchnorm_params" : 113,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_29_output",
      "type" : "activation",
      "name" : "activation_29",
      "bottom" : "dense_1_7_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_30_output",
      "blob_weights" : 117,
      "K" : 352,
      "blob_biases" : 115,
      "name" : "dense_1_7_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_29_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_1_7_conv2D_output",
      "blob_weights" : 119,
      "K" : 128,
      "name" : "dense_1_7_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_30_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_14_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_14",
      "bottom" : "concatenate_13_output,dense_1_7_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_14_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_14_output",
      "type" : "activation",
      "name" : "concatenate_14__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_1_8_bn",
      "bottom" : "concatenate_14_output",
      "weights" : {

      },
      "top" : "dense_1_8_bn_output",
      "C" : 384,
      "blob_batchnorm_params" : 121,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_31_output",
      "type" : "activation",
      "name" : "activation_31",
      "bottom" : "dense_1_8_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_32_output",
      "blob_weights" : 125,
      "K" : 384,
      "blob_biases" : 123,
      "name" : "dense_1_8_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_31_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_1_8_conv2D_output",
      "blob_weights" : 127,
      "K" : 128,
      "name" : "dense_1_8_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_32_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_15_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_15",
      "bottom" : "concatenate_14_output,dense_1_8_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_15_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_15_output",
      "type" : "activation",
      "name" : "concatenate_15__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_1_9_bn",
      "bottom" : "concatenate_15_output",
      "weights" : {

      },
      "top" : "dense_1_9_bn_output",
      "C" : 416,
      "blob_batchnorm_params" : 129,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_33_output",
      "type" : "activation",
      "name" : "activation_33",
      "bottom" : "dense_1_9_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_34_output",
      "blob_weights" : 133,
      "K" : 416,
      "blob_biases" : 131,
      "name" : "dense_1_9_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_33_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_1_9_conv2D_output",
      "blob_weights" : 135,
      "K" : 128,
      "name" : "dense_1_9_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_34_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_16_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_16",
      "bottom" : "concatenate_15_output,dense_1_9_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_16_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_16_output",
      "type" : "activation",
      "name" : "concatenate_16__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_1_10_bn",
      "bottom" : "concatenate_16_output",
      "weights" : {

      },
      "top" : "dense_1_10_bn_output",
      "C" : 448,
      "blob_batchnorm_params" : 137,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_35_output",
      "type" : "activation",
      "name" : "activation_35",
      "bottom" : "dense_1_10_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_36_output",
      "blob_weights" : 141,
      "K" : 448,
      "blob_biases" : 139,
      "name" : "dense_1_10_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_35_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_1_10_conv2D_output",
      "blob_weights" : 143,
      "K" : 128,
      "name" : "dense_1_10_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_36_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_17_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_17",
      "bottom" : "concatenate_16_output,dense_1_10_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_17_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_17_output",
      "type" : "activation",
      "name" : "concatenate_17__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_1_11_bn",
      "bottom" : "concatenate_17_output",
      "weights" : {

      },
      "top" : "dense_1_11_bn_output",
      "C" : 480,
      "blob_batchnorm_params" : 145,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_37_output",
      "type" : "activation",
      "name" : "activation_37",
      "bottom" : "dense_1_11_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_38_output",
      "blob_weights" : 149,
      "K" : 480,
      "blob_biases" : 147,
      "name" : "dense_1_11_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_37_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_1_11_conv2D_output",
      "blob_weights" : 151,
      "K" : 128,
      "name" : "dense_1_11_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_38_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_18_output",
      "type" : "concat",
      "name" : "concatenate_18",
      "bottom" : "concatenate_17_output,dense_1_11_conv2D_output"
    },
    {
      "name" : "tr_1_bn",
      "bottom" : "concatenate_18_output",
      "weights" : {

      },
      "top" : "tr_1_bn_output",
      "C" : 512,
      "blob_batchnorm_params" : 153,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_39_output",
      "type" : "activation",
      "name" : "activation_39",
      "bottom" : "tr_1_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "tr_1_conv2D_output",
      "blob_weights" : 155,
      "K" : 512,
      "name" : "tr_1_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 256,
      "bottom" : "activation_39_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 0,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "tr_1_conv2D_output",
      "pad_l" : 0,
      "name" : "average_pooling2d_2",
      "top" : "average_pooling2d_2_output"
    },
    {
      "name" : "dense_2_0_bn",
      "bottom" : "average_pooling2d_2_output",
      "weights" : {

      },
      "top" : "dense_2_0_bn_output",
      "C" : 256,
      "blob_batchnorm_params" : 157,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_40_output",
      "type" : "activation",
      "name" : "activation_40",
      "bottom" : "dense_2_0_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_41_output",
      "blob_weights" : 161,
      "K" : 256,
      "blob_biases" : 159,
      "name" : "dense_2_0_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_40_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_2_0_conv2D_output",
      "blob_weights" : 163,
      "K" : 128,
      "name" : "dense_2_0_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_41_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_19_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_19",
      "bottom" : "average_pooling2d_2_output,dense_2_0_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_19_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_19_output",
      "type" : "activation",
      "name" : "concatenate_19__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_2_1_bn",
      "bottom" : "concatenate_19_output",
      "weights" : {

      },
      "top" : "dense_2_1_bn_output",
      "C" : 288,
      "blob_batchnorm_params" : 165,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_42_output",
      "type" : "activation",
      "name" : "activation_42",
      "bottom" : "dense_2_1_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_43_output",
      "blob_weights" : 169,
      "K" : 288,
      "blob_biases" : 167,
      "name" : "dense_2_1_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_42_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_2_1_conv2D_output",
      "blob_weights" : 171,
      "K" : 128,
      "name" : "dense_2_1_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_43_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_20_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_20",
      "bottom" : "concatenate_19_output,dense_2_1_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_20_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_20_output",
      "type" : "activation",
      "name" : "concatenate_20__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_2_2_bn",
      "bottom" : "concatenate_20_output",
      "weights" : {

      },
      "top" : "dense_2_2_bn_output",
      "C" : 320,
      "blob_batchnorm_params" : 173,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_44_output",
      "type" : "activation",
      "name" : "activation_44",
      "bottom" : "dense_2_2_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_45_output",
      "blob_weights" : 177,
      "K" : 320,
      "blob_biases" : 175,
      "name" : "dense_2_2_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_44_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_2_2_conv2D_output",
      "blob_weights" : 179,
      "K" : 128,
      "name" : "dense_2_2_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_45_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_21_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_21",
      "bottom" : "concatenate_20_output,dense_2_2_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_21_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "top" : "concatenate_21_output",
      "type" : "activation",
      "name" : "concatenate_21__tmp__identity__",
      "beta" : 0
    },
    {
      "name" : "dense_2_3_bn",
      "bottom" : "concatenate_21_output",
      "weights" : {

      },
      "top" : "dense_2_3_bn_output",
      "C" : 352,
      "blob_batchnorm_params" : 181,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_46_output",
      "type" : "activation",
      "name" : "activation_46",
      "bottom" : "dense_2_3_bn_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_47_output",
      "blob_weights" : 185,
      "K" : 352,
      "blob_biases" : 183,
      "name" : "dense_2_3_bottleneck_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_46_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dense_2_3_conv2D_output",
      "blob_weights" : 187,
      "K" : 128,
      "name" : "dense_2_3_conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_47_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_22_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_22",
      "bottom" : "concatenate_21_output,dense_2_3_conv2D_output"
    },
    {
      "alpha" : 1,
      "bottom" : "concatenate_22_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
